openfoam/arc_M1.6_s03_wmuscl/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
#include "../constant/freestreamProperties"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInf;

boundaryField
{
    inlet       { type fixedValue; value uniform $omegaInf; }
    outlet      { type zeroGradient; }
    farfield    { type freestream; freestreamValue uniform $omegaInf; }
    fuselage    { type omegaWallFunction; value uniform $omegaInf; }
    stabilizers { type omegaWallFunction; value uniform $omegaInf; }
}
